; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-80)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b24)
    (on b24 b12)
    (on b12 b3)
    (on b3 b9)
    (on b9 b7)
    (on b7 b13)
    (on b13 b2)
    (on b2 b23)
    (on b23 b6)
    (on b6 b17)
    (on b17 b11)
    (on b11 b1)
    (on b1 b22)
    (on b22 b15)
    (on b15 b18)
    (on b18 b4)
    (on b4 b21)
    (on b21 b5)
    (on b5 b10)
    (on b10 b16)
    (on b16 b14)
    (on b14 b19)
    (on b19 b20)
    (on b20 b8)
    (on-table b8))
 (:goal (and 
(on-table b17)
))
)

; plan
1. (unstack b24 b12)
   deleted: (on b24 b12) (clear b24) (arm-empty)
   added: (holding b24) (clear b12)
   goals met: 0 of 1
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
3. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 0 of 1
4. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
5. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 1
6. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
7. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 0 of 1
8. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
9. (unstack b7 b13)
   deleted: (on b7 b13) (clear b7) (arm-empty)
   added: (holding b7) (clear b13)
   goals met: 0 of 1
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
11. (unstack b13 b2)
   deleted: (on b13 b2) (clear b13) (arm-empty)
   added: (holding b13) (clear b2)
   goals met: 0 of 1
12. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
13. (unstack b2 b23)
   deleted: (on b2 b23) (clear b2) (arm-empty)
   added: (holding b2) (clear b23)
   goals met: 0 of 1
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
15. (unstack b23 b6)
   deleted: (on b23 b6) (clear b23) (arm-empty)
   added: (holding b23) (clear b6)
   goals met: 0 of 1
16. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
17. (unstack b6 b17)
   deleted: (on b6 b17) (clear b6) (arm-empty)
   added: (holding b6) (clear b17)
   goals met: 0 of 1
18. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
19. (unstack b17 b11)
   deleted: (on b17 b11) (clear b17) (arm-empty)
   added: (holding b17) (clear b11)
   goals met: 0 of 1
20. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 1
